/**
 * 1、通过系统地学习和总结获取知识
 * 2、通过勤奋练习提升编程能力
 * 3、通过工作经验获取架构和工程能力
 *
 *
 *
 * 编程语言的一般规律：用一定的词法和语法，表达一定的语义，从而操作运行时
 *
 *                          |--类型--对象
 *                          |
 * JS--|--运行时--|--数据结构--|--实例--应用和机制
 *     |         |
 *     |         |--执行过程（算法）--|--事件循环
 *     |                           |
 *     |                           |--微任务执行
 *     |                           |
 *     |                           |--函数执行
 *     |                           |
 *     |                           |--语句执行
 *     |
 *     |--文法--|--词法
 *     |       |
 *     |       |--语法
 *     |--语义
 *
 *
 *
 *
 *
 *
 * HTML和CSS--|--HTML--|--元素--|--文档元信息
 *            |        |       |
 *            |        |       |--语义相关内容
 *            |        |       |
 *            |        |       |--链接
 *            |        |       |
 *            |        |       |--替换型元素
 *            |        |       |
 *            |        |       |--表单
 *            |        |       |
 *            |        |       |--表格
 *            |        |       |
 *            |        |       |--总集
 *            |        |
 *            |        |--语言--|--实体
 *            |        |       |
 *            |        |       |--命名空间
 *            |        |
 *            |        |--补充标准
 *            |
 *            |--CSS--|--语言--|--@rule
 *                    |       |
 *                    |       |--选择器
 *                    |       |
 *                    |       |--单位
 *                    |
 *                    |--功能--|--布局--|--正常流
 *                            |       |
 *                            |       |--弹性布局
 *                            |
 *                            |--绘制--|--颜色和形状
 *                            |       |
 *                            |       |--文字相关
 *                            |
 *                            |--交互--|--动画
 *                                    |
 *                                    |--其他交互
 *
 *
 * 浏览器的实现原理和API--|--实现原理--|--解析
 *                     |          |
 *                     |          |--构建DOM树
 *                     |          |
 *                     |          |--计算CSS
 *                     |          |
 *                     |          |--渲染、合成和绘制
 *                     |
 *                     |--API--|--DOM
 *                             |
 *                             |--CSSOM
 *                             |
 *                             |--事件
 *                             |
 *                             |--API总集合
 *
 *
 *
 */